app/Controllers/Auth.php

    public function login()
    {
        if ($this->request->getMethod() === 'POST') {
            $telephone = trim($this->request->getPost('telephone'));

            // Validation simple : numéro non vide
            if (empty($telephone)) {
                return redirect()->back()->with('error', 'Veuillez saisir un numéro de téléphone.');
            }

            $clientModel = new ClientModel();

            // Recherche du client par téléphone
            $client = $clientModel->where('telephone', $telephone)->first();
---
SELECT *
FROM `clients`
WHERE `telephone` = '0329876543'
 LIMIT 1