app/Controllers/Client.php

    public function espace()
    {
        $client = session()->get('client');
        if (!$client) {
            return redirect()->to('/login')->with('error', 'Veuillez vous connecter.');
        }

        // Recharger le client depuis la base pour avoir le solde à jour
        $clientModel = new ClientModel();
        $client = $clientModel->find($client['id']);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1

            'statut'            => 'termine',
        ];

        if ($transactionModel->insert($transactionData)) {
            $clientModel = new ClientModel();
            $clientUpdated = $clientModel->find($client['id']);
---
INSERT INTO `transactions` (`type`, `montant`, `frais`, `emetteur_id`, `recepteur_id`, `operateur_id`, `statut`) VALUES ('depot', 500, 20, NULL, 2, 1, 'termine')
SELECT *
FROM `clients`
WHERE `clients`.`id` = 2

 public function traitementTransfert()
{
    $client = session()->get('client');
    if (!$client) {
        return redirect()->to('/login')->with('error', 'Veuillez vous connecter.');
    }

    $montantSaisi = (float) $this->request->getPost('montant');
    $telephoneDestinataire = trim($this->request->getPost('telephone'));
    $fraisInclus = (bool) $this->request->getPost('frais_inclus');

    if ($montantSaisi <= 0 || empty($telephoneDestinataire)) {
        return redirect()->back()->with('error', 'Montant ou numéro invalide.');
    }
    if ($telephoneDestinataire === $client['telephone']) {
        return redirect()->back()->with('error', 'Vous ne pouvez pas transférer vers votre propre numéro.');
    }

    $operateurId = 1;
    $type = 'transfert';
    $regleFraisModel = new RegleFraisModel();
    $prefixModel = new PrefixeOperateurModel();
    $operateurModel = new OperateurModel();
    $operateurEmetteur = $operateurModel->find($operateurId);
---
SELECT *
FROM `operateurs`
WHERE `operateurs`.`id` = 1


    // Récupération ou création du destinataire
    $clientModel = new ClientModel();
    $destinataire = $clientModel->where('telephone', $telephoneDestinataire)->first();
---
SELECT *
FROM `clients`
WHERE `telephone` = '0312233445'
 LIMIT 1

        'statut'            => 'termine',
    ];

    if ($transactionModel->insert($transactionData)) {
        $clientUpdated = $clientModel->find($client['id']);
---
INSERT INTO `transactions` (`type`, `montant`, `frais`, `commission_externe`, `emetteur_id`, `recepteur_id`, `operateur_id`, `statut`) VALUES ('transfert', 500, 35, 10, 1, 4, 1, 'termine')
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1