app/Controllers/OperateurAuth.php

    public function login()
    {
        if ($this->request->getMethod() === 'POST') {
            $code = trim($this->request->getPost('code'));

            if (empty($code)) {
                return redirect()->back()->with('error', 'Veuillez saisir le code secret.');
            }

            $model = new OperateurModel();
            $operateur = $model->where('code_secret', $code)->first();
---
SELECT *
FROM `operateurs`
WHERE `code_secret` = 'orange2024'
 LIMIT 1