app/Models/ClientModel.php

    public function getAllClients(): array
    {
        return $this->orderBy('telephone', 'ASC')->findAll();
---
SELECT *
FROM `clients`
ORDER BY `telephone` ASC

    public function getTotaux(): array
    {
        $query = $this->selectCount('id', 'total_clients')
                      ->selectSum('solde', 'total_soldes')
                      ->first();
---
SELECT COUNT(`id`) AS `total_clients`, SUM(`solde`) AS `total_soldes`
FROM `clients`
 LIMIT 1