app/Models/PrefixeOperateurModel.php

SELECT *
FROM `operateurs`
WHERE `id` = 2
---
    public function getOperateurByTelephone(string $telephone): ?array
    {
        $prefixes = $this->orderBy('LENGTH(prefixe)', 'DESC')->findAll();
        foreach ($prefixes as $p) {
            if (strpos($telephone, $p['prefixe']) === 0) {
                return $this->db->table('operateurs')
                                ->where('id', $p['operateur_id'])
                                ->get()
                                ->getRowArray();