app/Models/TransactionModel.php

SELECT `transactions`.*, `e`.`telephone` AS `emetteur_telephone`, `r`.`telephone` AS `recepteur_telephone`
FROM `transactions`
LEFT JOIN `clients` `e` ON `e`.`id` = `transactions`.`emetteur_id`
LEFT JOIN `clients` `r` ON `r`.`id` = `transactions`.`recepteur_id`
WHERE   (
`emetteur_id` = 1
OR `recepteur_id` = 1
 )
ORDER BY `date_transaction` DESC
 LIMIT 50
---
    public function getHistoriqueClient(int $clientId, array $filtres = [], int $limit = 50): array
    {
        $builder = $this->select('transactions.*,
                                  e.telephone AS emetteur_telephone,
                                  r.telephone AS recepteur_telephone')
                        ->join('clients e', 'e.id = transactions.emetteur_id', 'left')
                        ->join('clients r', 'r.id = transactions.recepteur_id', 'left')
                        ->groupStart()
                            ->where('emetteur_id', $clientId)
                            ->orWhere('recepteur_id', $clientId)
                        ->groupEnd();

        if (!empty($filtres['type'])) {
            $builder->where('transactions.type', $filtres['type']);
        }
        if (!empty($filtres['date_debut'])) {
            $builder->where('date_transaction >=', $filtres['date_debut'] . ' 00:00:00');
        }
        if (!empty($filtres['date_fin'])) {
            $builder->where('date_transaction <=', $filtres['date_fin'] . ' 23:59:59');
        }

        return $builder->orderBy('date_transaction', 'DESC')
                       ->limit($limit)
                       ->find();